app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "url", "description", "price_in_cents", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "name" = ?, "description" = ?, "price_in_cents" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Somalia"], ["description", "Off the beaten path."], ["price_in_cents", 38], ["updated_at", "2015-10-21 01:26:52.177532"], ["id", 2]]