app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)

    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("comment", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def update
    respond_to do |format|
      if @review.update(review_params)
---
UPDATE "reviews" SET "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = ?